IDENTIFICATION DIVISION.
PROGRAM-ID. AMBER-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (1, 1, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT OUTPUT-BUFFER ASSIGN TO "GPU-BUFFER-0-0"
        ORGANIZATION IS ACCESS-STORAGE.
DATA DIVISION.
FILE SECTION.
FD  OUTPUT-BUFFER
    LAYOUT IS STD430.
01  RESULT-VAL PIC I.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE 42 TO RESULT-VAL OF OUTPUT-BUFFER.
        GOBACK.
