IDENTIFICATION DIVISION.
PROGRAM-ID. ARRAY-TEST.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. VULKAN-FRAGMENT-SHADER.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  MY-ARRAY    PIC FLOAT OCCURS 10 TIMES.
01  IDX         PIC I.
01  VAL         PIC FLOAT.

OUTPUT SECTION.
01  OUT-COLOR   PIC V(4) LOCATION 0.

PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE 0 TO IDX.
        MOVE 1.0 TO MY-ARRAY (IDX).
        
        MOVE 1 TO IDX.
        MOVE 2.0 TO MY-ARRAY (IDX).
        
        COMPUTE VAL = MY-ARRAY (0) + MY-ARRAY (1).
        
        IF VAL = 3.0
            MOVE (0.0, 1.0, 0.0, 1.0) TO OUT-COLOR
        ELSE
            MOVE (1.0, 0.0, 0.0, 1.0) TO OUT-COLOR
        END-IF.
        
        GOBACK.
