IDENTIFICATION DIVISION.
PROGRAM-ID. ATOMIC-AND-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (1, 1, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT TARGET-IMAGE ASSIGN TO "GPU-IMAGE-0-0"
        ORGANIZATION IS STORAGE-2D.
DATA DIVISION.
FILE SECTION.
FD  TARGET-IMAGE.
    FORMAT IS R32UI.
01  IMAGE-RECORD PIC U.
WORKING-STORAGE SECTION.
01  UV-COORDS           PIC IV(2).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE (0, 0) TO UV-COORDS.
        ATOMIC-AND 15 WITH TARGET-IMAGE AT UV-COORDS.
        GOBACK.
