IDENTIFICATION DIVISION.
PROGRAM-ID. ATOMIC-BUFFER-TEST.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT DATA-BUF ASSIGN TO "GPU-BUFFER-0-0"
        ORGANIZATION IS ACCESS-STORAGE.
DATA DIVISION.
FILE SECTION.
FD  DATA-BUF
    LAYOUT IS STD430.
01  STORAGE-DATA.
    05  VAL-I PIC I.
    05  VAL-U PIC U.
WORKING-STORAGE SECTION.
01  OLD-I PIC I.
01  OLD-U PIC U.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        ATOMIC-ADD 10 TO VAL-I OF STORAGE-DATA GIVING OLD-I.
        ATOMIC-SUB 5 FROM VAL-U OF STORAGE-DATA GIVING OLD-U.
        ATOMIC-AND 255 WITH VAL-I OF STORAGE-DATA.
        ATOMIC-OR 1 WITH VAL-U OF STORAGE-DATA.
        ATOMIC-XOR 2 WITH VAL-I OF STORAGE-DATA.
        ATOMIC-MIN 100 WITH VAL-U OF STORAGE-DATA.
        ATOMIC-MAX 0 WITH VAL-I OF STORAGE-DATA.
        ATOMIC-EXCHANGE 42 WITH VAL-U OF STORAGE-DATA.
        ATOMIC-COMPARE-EXCHANGE 100 AND 42 WITH VAL-U OF STORAGE-DATA.
        GOBACK.
