IDENTIFICATION DIVISION.
PROGRAM-ID. BITWISE-ERR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  F1      PIC FLOAT VALUE 1.0.
01  R1      PIC FLOAT.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        COMPUTE R1 = F1 BIT-AND 1.0.
        GOBACK.
