IDENTIFICATION DIVISION.
PROGRAM-ID. BITWISE-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  A       PIC I VALUE 5.
01  B       PIC I VALUE 3.
01  R1      PIC I.
01  R2      PIC I.
01  R3      PIC I.
01  R4      PIC I.
01  R5      PIC I.
01  R6      PIC I.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        COMPUTE R1 = A BIT-AND B.
        COMPUTE R2 = A BIT-OR B.
        COMPUTE R3 = A BIT-XOR B.
        COMPUTE R4 = BIT-NOT A.
        COMPUTE R5 = A BIT-LSHIFT 1.
        COMPUTE R6 = A BIT-RSHIFT 1.
        GOBACK.
