IDENTIFICATION DIVISION.
PROGRAM-ID. BUILTINS-TEST.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    GPU-GLOBAL-ID IS G-ID
    GPU-LOCAL-ID IS L-ID
    GPU-WORKGROUP-ID IS W-ID
    GPU-NUM-WORKGROUPS IS N-WG
    GPU-LOCAL-INDEX IS L-IDX
    GPU-WORKGROUP-SIZE IS WG-SZ
    GPU-SUBGROUP-ID IS SG-ID
    GPU-SUBGROUP-SIZE IS SG-SZ
    GPU-SUBGROUP-INVOCATION-ID IS SG-INV
    GPU-NUM-SUBGROUPS IS N-SG
    GPU-SUBGROUP-EQ-MASK IS M-EQ.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01  G-ID        PIC UV(3) IS BUILT-IN.
    01  L-ID        PIC UV(3) IS BUILT-IN.
    01  W-ID        PIC UV(3) IS BUILT-IN.
    01  N-WG        PIC UV(3) IS BUILT-IN.
    01  L-IDX       PIC U IS BUILT-IN.
    01  WG-SZ       PIC UV(3) IS BUILT-IN.
    01  SG-ID       PIC U IS BUILT-IN.
    01  SG-SZ       PIC U IS BUILT-IN.
    01  SG-INV      PIC U IS BUILT-IN.
    01  N-SG        PIC U IS BUILT-IN.
    01  M-EQ        PIC UV(4) IS BUILT-IN.

    01  TARGET-U    PIC U.
    01  TARGET-UV3  PIC UV(3).
    01  TARGET-UV4  PIC UV(4).

PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE G-ID TO TARGET-UV3.
        MOVE L-ID TO TARGET-UV3.
        MOVE W-ID TO TARGET-UV3.
        MOVE N-WG TO TARGET-UV3.
        MOVE L-IDX TO TARGET-U.
        MOVE WG-SZ TO TARGET-UV3.
        MOVE SG-ID TO TARGET-U.
        MOVE SG-SZ TO TARGET-U.
        MOVE SG-INV TO TARGET-U.
        MOVE N-SG TO TARGET-U.
        MOVE M-EQ TO TARGET-UV4.
        GOBACK.
