IDENTIFICATION DIVISION.
PROGRAM-ID. COHORT-ELECT-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1).
DATA DIVISION.
WORKING-STORAGE SECTION.
01  IS-LEADER       PIC B.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        CONSULT COHORT FOR ELECT GIVING IS-LEADER.
        GOBACK.
