IDENTIFICATION DIVISION.
PROGRAM-ID. COHORT-SCAN-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1).
DATA DIVISION.
WORKING-STORAGE SECTION.
01  VAL-I           PIC I VALUE 1.
01  COHORT-SCAN     PIC I.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        CONSULT COHORT FOR SUM INCLUSIVE-SCAN OF VAL-I GIVING COHORT-SCAN.
        GOBACK.
