IDENTIFICATION DIVISION.
PROGRAM-ID. COHORT-SUM-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1).
DATA DIVISION.
WORKING-STORAGE SECTION.
01  VAL-F           PIC FLOAT VALUE 1.0.
01  COHORT-SUM      PIC FLOAT.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        CONSULT COHORT FOR SUM OF VAL-F GIVING COHORT-SUM.
        GOBACK.
