* THIS IS A TRADITIONAL COMMENT
IDENTIFICATION DIVISION.
PROGRAM-ID. COMMENT-TEST. *> THIS IS AN INLINE COMMENT
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 A PIC FLOAT.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE 1.0 TO A.
        GOBACK.
