IDENTIFICATION DIVISION.
PROGRAM-ID. COMPUTE-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 A PIC FLOAT VALUE 1.0.
    01 V1 PIC V(3) VALUE (1.0, 2.0, 3.0).
    01 V2 PIC V(3).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        COMPUTE V2 = V1 * 2.0 + (0.5, 0.5, 0.5).
        GOBACK.
