IDENTIFICATION DIVISION.
PROGRAM-ID. DATA-TYPES.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 MY-INT PIC I.
    01 MY-FLOAT PIC FLOAT.
    01 MY-VEC PIC IV(3).
    01 MY-MAT PIC M(2,2).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        GOBACK.
