IDENTIFICATION DIVISION.
PROGRAM-ID. DEBUG-INFO-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-VAR PIC I.
01 ANOTHER-VAR PIC I.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE 42 TO MY-VAR.
        COMPUTE ANOTHER-VAR = MY-VAR + 10.
        GOBACK.
