IDENTIFICATION DIVISION.
PROGRAM-ID. ENV-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1)
    GPU-GLOBAL-ID IS THREAD-COORD.
DATA DIVISION.
LINKAGE SECTION.
    01 THREAD-COORD PIC IV(3) IS BUILT-IN.
WORKING-STORAGE SECTION.
    01 MY-ID PIC I.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE X OF THREAD-COORD TO MY-ID.
        GOBACK.
