IDENTIFICATION DIVISION.
PROGRAM-ID. ERR-TYPE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC FLOAT.
01 B PIC V(3).
PROCEDURE DIVISION.
    MAIN.
        MOVE B TO A.
        GOBACK.
