IDENTIFICATION DIVISION.
PROGRAM-ID. ERR-INVALID-CALL.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        CALL "GLSL.NONEXISTENT" USING 1.0.
        GOBACK.
