IDENTIFICATION DIVISION.
PROGRAM-ID. ERR-TEST.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IMG-F ASSIGN TO "GPU-IMAGE-0-0" ORGANIZATION IS IMAGE-2D
DATA DIVISION.
PROCEDURE DIVISION.
    GOBACK.
