IDENTIFICATION DIVISION.
PROGRAM-ID. FRAGMENT-BASIC.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. VULKAN-FRAGMENT-SHADER.
SPECIAL-NAMES.
    GPU-FRAG-COORD IS FRAG-COORD.
DATA DIVISION.
INPUT SECTION.
01  FRAG-COORD PIC V(4) IS BUILT-IN.
OUTPUT SECTION.
01  OUT-COLOR PIC V(4) LOCATION 0.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE FRAG-COORD TO OUT-COLOR.
        GOBACK.
