IDENTIFICATION DIVISION.
PROGRAM-ID. GLSL-MATH-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 SRC-VAL PIC FLOAT VALUE 1.0.
01 SIN-VAL PIC FLOAT.
01 SIG-VAL PIC FLOAT.
01 EXP-VAL PIC I.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        CALL "GLSL.SIN" USING SRC-VAL GIVING SIN-VAL.
        CALL "GLSL.FREXP" USING SRC-VAL GIVING SIG-VAL, EXP-VAL.
        GOBACK.
