IDENTIFICATION DIVISION.
PROGRAM-ID. GLSL-MODF-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 SRC-VAL PIC FLOAT VALUE 2.5.
01 FRAC-VAL PIC FLOAT.
01 INT-VAL PIC FLOAT.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        CALL "GLSL.MODF" USING SRC-VAL GIVING FRAC-VAL, INT-VAL.
        GOBACK.
