IDENTIFICATION DIVISION.
PROGRAM-ID. GPU-RESOURCES-TEST.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IMG-F ASSIGN TO "GPU-IMAGE-0-0" 
        ORGANIZATION IS IMAGE-2D.
    SELECT TEX-F ASSIGN TO "GPU-IMAGE-0-1" 
        ORGANIZATION IS TEXTURE-2D.
    SELECT SMP-F ASSIGN TO "GPU-SAMPLER-0-2" 
        ORGANIZATION IS SAMPLER.
    SELECT STO-F ASSIGN TO "GPU-IMAGE-0-3" 
        ORGANIZATION IS STORAGE-2D
        ACCESS MODE IS READ-ONLY.
DATA DIVISION.
FILE SECTION.
FD  IMG-F.
01  REC-F PIC V(4).
FD  TEX-F.
01  REC-T PIC V(4).
FD  STO-F.
    FORMAT IS R32F.
01  REC-S PIC V.
PROCEDURE DIVISION.
    MAIN.
        GOBACK.
