IDENTIFICATION DIVISION.
PROGRAM-ID. GRAPHICS-BUILTINS-VERTEX.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. VULKAN-VERTEX-SHADER.
SPECIAL-NAMES.
    GPU-DRAW-ID IS DRAW-ID
    GPU-BASE-VERTEX IS BASE-VERTEX
    GPU-BASE-INSTANCE IS BASE-INSTANCE.
DATA DIVISION.
INPUT SECTION.
01  DRAW-ID PIC I IS BUILT-IN.
01  BASE-VERTEX PIC I IS BUILT-IN.
01  BASE-INSTANCE PIC I IS BUILT-IN.
OUTPUT SECTION.
01  OUT-VAL PIC IV(3) LOCATION 0.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE DRAW-ID TO X OF OUT-VAL.
        MOVE BASE-VERTEX TO Y OF OUT-VAL.
        MOVE BASE-INSTANCE TO Z OF OUT-VAL.
        GOBACK.
