IDENTIFICATION DIVISION.
PROGRAM-ID. GRAPHICS-BUILTINS-FRAGMENT.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. VULKAN-FRAGMENT-SHADER.
SPECIAL-NAMES.
    GPU-POINT-COORD IS PT-COORD
    GPU-SAMPLE-ID IS SAMP-ID
    GPU-SAMPLE-POSITION IS SAMP-POS
    GPU-SAMPLE-MASK-IN IS SAMP-MASK-IN
    GPU-SAMPLE-MASK IS SAMP-MASK-OUT.
DATA DIVISION.
INPUT SECTION.
01  PT-COORD PIC V(2) IS BUILT-IN.
01  SAMP-ID PIC I IS BUILT-IN.
01  SAMP-POS PIC V(2) IS BUILT-IN.
01  SAMP-MASK-IN PIC I IS BUILT-IN.
OUTPUT SECTION.
01  SAMP-MASK-OUT PIC I IS BUILT-IN.
01  OUT-COLOR PIC V(4) LOCATION 0.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE PT-COORD TO RED GREEN OF OUT-COLOR.
        MOVE SAMP-POS TO BLUE ALPHA OF OUT-COLOR.
        MOVE SAMP-MASK-IN TO SAMP-MASK-OUT.
        GOBACK.
