IDENTIFICATION DIVISION.
PROGRAM-ID. IMAGE-TYPES.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IMG-F ASSIGN TO "GPU-IMAGE-0-0" ORGANIZATION IS IMAGE-2D.
    SELECT IMG-I ASSIGN TO "GPU-IMAGE-0-1" ORGANIZATION IS IMAGE-2D.
    SELECT IMG-U ASSIGN TO "GPU-IMAGE-0-2" ORGANIZATION IS IMAGE-2D.
DATA DIVISION.
FILE SECTION.
FD  IMG-F.
01  REC-F PIC V(4).
FD  IMG-I.
01  REC-I PIC IV(4).
FD  IMG-U.
01  REC-U PIC UV(4).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        GOBACK.
