IDENTIFICATION DIVISION.
PROGRAM-ID. IMAGE-SIZE-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IMG ASSIGN TO "GPU-IMAGE-0-0" ORGANIZATION IS STORAGE-2D.
DATA DIVISION.
FILE SECTION.
FD  IMG FORMAT IS RGBA32F.
01  IMG-REC PIC V(4).
WORKING-STORAGE SECTION.
01  DIMS PIC IV(2).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        INQUIRE IMG FOR SIZE GIVING DIMS.
        GOBACK.
