IDENTIFICATION DIVISION.
PROGRAM-ID. IMAGE-TEST.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT SOURCE-IMAGE ASSIGN TO "GPU-IMAGE-0-0"
        ORGANIZATION IS IMAGE-2D.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        GOBACK.
