IDENTIFICATION DIVISION.
PROGRAM-ID. IMAGE-FETCH-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (1, 1, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT SOURCE-IMAGE ASSIGN TO "GPU-IMAGE-0-0"
        ORGANIZATION IS IMAGE-2D.
DATA DIVISION.
FILE SECTION.
FD  SOURCE-IMAGE.
01  IMAGE-RECORD PIC V(4).
WORKING-STORAGE SECTION.
01  IV-COORDS           PIC IV(2).
01  RAW-PIXEL           PIC V(4).
01  LOD-VAL             PIC I VALUE 0.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE (10, 20) TO IV-COORDS.
        READ SOURCE-IMAGE 
            FETCH AT IV-COORDS 
            AT LOD LOD-VAL
            INTO RAW-PIXEL.
        GOBACK.
