IDENTIFICATION DIVISION.
PROGRAM-ID. INTERPOLATION-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. VULKAN-FRAGMENT-SHADER.
DATA DIVISION.
INPUT SECTION.
01  IN-COLOR    PIC V(4) LOCATION 0.
01  IN-UV       PIC V(2) LOCATION 1.
OUTPUT SECTION.
01  OUT-COLOR   PIC V(4) LOCATION 0.
WORKING-STORAGE SECTION.
01  TMP-COLOR   PIC V(4).
01  OFFSET-VEC  PIC V(2) VALUE (0.1, 0.1).
01  SAMP-IDX    PIC I VALUE 1.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        INTERPOLATE IN-COLOR AT CENTROID GIVING TMP-COLOR.
        MOVE TMP-COLOR TO OUT-COLOR.
        
        INTERPOLATE IN-COLOR AT SAMPLE SAMP-IDX GIVING TMP-COLOR.
        COMPUTE OUT-COLOR = OUT-COLOR + TMP-COLOR.
        
        INTERPOLATE IN-COLOR AT OFFSET OFFSET-VEC GIVING TMP-COLOR.
        COMPUTE OUT-COLOR = OUT-COLOR + TMP-COLOR.
        
        GOBACK.
