IDENTIFICATION DIVISION.
PROGRAM-ID. INVALID-SUBSCRIPT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  NOT-AN-ARRAY PIC V.
PROCEDURE DIVISION.
    MAIN.
        MOVE 1.0 TO NOT-AN-ARRAY (0).
