IDENTIFICATION DIVISION.
PROGRAM-ID. INVALID-BUILTIN.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. VULKAN-VERTEX-SHADER.
SPECIAL-NAMES.
    GPU-GLOBAL-ID IS MY-ID.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-ID PIC UV(3) IS BUILT-IN.
PROCEDURE DIVISION.
    MAIN-LOGIC.
    MOVE MY-ID TO MY-ID.
    GOBACK.
