       IDENTIFICATION DIVISION.
       PROGRAM-ID. INVALID-GLSL-FUNC.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       OBJECT-COMPUTER. VULKAN-COMPUTE-SHADER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-X PIC V(4).
       01 VAR-Y PIC V(4).
       PROCEDURE DIVISION.
       MAIN-LOGIC.
           CALL "GLSL.HAM-SANDWICH" USING VAR-X GIVING VAR-Y.
           GOBACK.
