IDENTIFICATION DIVISION.
PROGRAM-ID. LOGICAL-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  A PIC FLOAT VALUE 1.0.
01  B PIC FLOAT VALUE 2.0.
01  C PIC FLOAT VALUE 3.0.
01  RES-AND-OR PIC BV.
PROCEDURE DIVISION.
    MAIN.
        COMPUTE RES-AND-OR = (A < B) AND (B < C).
        COMPUTE RES-AND-OR = (A > B) OR (B < C).
        GOBACK.
