IDENTIFICATION DIVISION.
PROGRAM-ID. MATRIX-VEC-TEST.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT SETTINGS ASSIGN TO "GPU-PUSH-CONSTANT"
        ORGANIZATION IS ACCESS-PUSH.
DATA DIVISION.
FILE SECTION.
FD  SETTINGS.
01  SETTINGS-DATA.
    05  TRANSFORM PIC M(4,4).
WORKING-STORAGE SECTION.
01  IN-POS PIC V(4) VALUE (1.0, 2.0, 3.0, 1.0).
01  OUT-POS PIC V(4).
PROCEDURE DIVISION.
    MAIN.
        COMPUTE OUT-POS = TRANSFORM OF SETTINGS-DATA * IN-POS.
        GOBACK.
