IDENTIFICATION DIVISION.
PROGRAM-ID. MOVE-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 MY-INT PIC I.
    01 OTHER-INT PIC I.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE 42 TO MY-INT.
        MOVE MY-INT TO OTHER-INT.
        GOBACK.
