IDENTIFICATION DIVISION.
PROGRAM-ID. MULTI-TEXTURE-QUERY-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT TEX1D ASSIGN TO "GPU-IMAGE-0-0" ORGANIZATION IS IMAGE-1D.
    SELECT TEX2D ASSIGN TO "GPU-IMAGE-0-1" ORGANIZATION IS IMAGE-2D.
    SELECT TEX3D ASSIGN TO "GPU-IMAGE-0-2" ORGANIZATION IS IMAGE-3D.
DATA DIVISION.
FILE SECTION.
FD  TEX1D.
01  REC1D PIC V.
FD  TEX2D.
01  REC2D PIC V(4).
FD  TEX3D.
01  REC3D PIC V(4).
WORKING-STORAGE SECTION.
01  SIZE1D PIC I.
01  SIZE2D PIC IV(2).
01  SIZE3D PIC IV(3).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        INQUIRE TEX1D FOR SIZE AT LOD 0 GIVING SIZE1D.
        INQUIRE TEX2D FOR SIZE GIVING SIZE2D.
        INQUIRE TEX3D FOR SIZE AT LOD 1 GIVING SIZE3D.
        GOBACK.
