IDENTIFICATION DIVISION.
PROGRAM-ID. MULTI-IMAGE-QUERY-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IMG1D ASSIGN TO "GPU-IMAGE-0-0" ORGANIZATION IS STORAGE-1D.
    SELECT IMG2D ASSIGN TO "GPU-IMAGE-0-1" ORGANIZATION IS STORAGE-2D.
    SELECT IMG3D ASSIGN TO "GPU-IMAGE-0-2" ORGANIZATION IS STORAGE-3D.
DATA DIVISION.
FILE SECTION.
FD  IMG1D FORMAT IS R32F.
01  REC1D PIC V.
FD  IMG2D FORMAT IS RGBA32F.
01  REC2D PIC V(4).
FD  IMG3D FORMAT IS RGBA32F.
01  REC3D PIC V(4).
WORKING-STORAGE SECTION.
01  SIZE1D PIC I.
01  SIZE2D PIC IV(2).
01  SIZE3D PIC IV(3).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        INQUIRE IMG1D FOR SIZE GIVING SIZE1D.
        INQUIRE IMG2D FOR SIZE GIVING SIZE2D.
        INQUIRE IMG3D FOR SIZE GIVING SIZE3D.
        GOBACK.
