IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-UNTIL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  I PIC I VALUE 0.
01  RES PIC FLOAT VALUE 0.0.
PROCEDURE DIVISION.
    MAIN.
        PERFORM UNTIL I = 10
            COMPUTE I = I + 1
            COMPUTE RES = RES + 1.0
        END-PERFORM.
        GOBACK.
