IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  I PIC I.
01  J PIC I.
01  RES PIC FLOAT VALUE 0.0.
PROCEDURE DIVISION.
    MAIN.
        PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
            PERFORM VARYING J FROM 1 BY 1 UNTIL J > 5
                COMPUTE RES = RES + 1.0
            END-PERFORM
        END-PERFORM.
        GOBACK.
