IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-TIMES.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  RES PIC FLOAT VALUE 0.0.
01  CNT PIC I VALUE 5.
PROCEDURE DIVISION.
    MAIN.
        PERFORM 10 TIMES
            COMPUTE RES = RES + 1.0
        END-PERFORM.
        
        PERFORM CNT TIMES
            COMPUTE RES = RES + 2.0
        END-PERFORM.
        
        GOBACK.
