IDENTIFICATION DIVISION.
PROGRAM-ID. REL-INT-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  I1 PIC I VALUE 10.
01  I2 PIC I VALUE 20.
01  RES-EQ PIC BV.
01  RES-GT PIC BV.
PROCEDURE DIVISION.
    MAIN.
        COMPUTE RES-EQ = I1 EQUAL TO I2.
        COMPUTE RES-GT = I1 > I2.
        GOBACK.
