IDENTIFICATION DIVISION.
PROGRAM-ID. REL-NOT-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  A PIC FLOAT VALUE 1.0.
01  B PIC FLOAT VALUE 2.0.
01  RES-NOT PIC BV.
PROCEDURE DIVISION.
    MAIN.
        COMPUTE RES-NOT = NOT A = B.
        GOBACK.
