IDENTIFICATION DIVISION.
PROGRAM-ID. REL-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  A PIC FLOAT VALUE 1.0.
01  B PIC FLOAT VALUE 2.0.
01  RES-EQ PIC BV.
01  RES-GT PIC BV.
01  RES-LT PIC BV.
01  RES-SYM PIC BV.
PROCEDURE DIVISION.
    MAIN.
        COMPUTE RES-EQ = A EQUAL TO B.
        COMPUTE RES-GT = A GREATER THAN B.
        COMPUTE RES-LT = A LESS THAN B.
        COMPUTE RES-SYM = A > B.
        GOBACK.
