IDENTIFICATION DIVISION.
PROGRAM-ID. IMAGE-3D-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (1, 1, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT SOURCE-IMAGE ASSIGN TO "GPU-IMAGE-0-0"
        ORGANIZATION IS IMAGE-3D.
DATA DIVISION.
FILE SECTION.
FD  SOURCE-IMAGE.
01  IMAGE-RECORD PIC V(4).
WORKING-STORAGE SECTION.
01  UV-COORDS           PIC V(3).
01  RAW-PIXEL           PIC V(4).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE (0.5, 0.5, 0.5) TO UV-COORDS.
        READ SOURCE-IMAGE 
            AT UV-COORDS 
            INTO RAW-PIXEL.
        GOBACK.
