IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLED-IMAGE-SIZE-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT SAMPLED-IMG ASSIGN TO "GPU-IMAGE-0-0" ORGANIZATION IS IMAGE-2D.
DATA DIVISION.
FILE SECTION.
FD  SAMPLED-IMG.
01  SAMPLED-REC PIC V(4).
WORKING-STORAGE SECTION.
01  DIMS PIC IV(2).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        INQUIRE SAMPLED-IMG FOR SIZE GIVING DIMS.
        GOBACK.
