IDENTIFICATION DIVISION.
PROGRAM-ID. SCALAR-UNIFORM-ERR.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT UBO ASSIGN TO "GPU-BUFFER-0-0"
        ORGANIZATION IS ACCESS-UNIFORM.
DATA DIVISION.
FILE SECTION.
FD  UBO
    LAYOUT IS SCALAR.
01  UBO-DATA.
    05  VAL PIC FLOAT.
WORKING-STORAGE SECTION.
01  TMP PIC FLOAT.
PROCEDURE DIVISION.
    MAIN.
        MOVE VAL OF UBO-DATA TO TMP.
        GOBACK.
