IDENTIFICATION DIVISION.
PROGRAM-ID. SHARED-STORAGE-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1).
DATA DIVISION.
LOCAL-STORAGE SECTION.
01  SHARED-VAL      PIC I.
WORKING-STORAGE SECTION.
01  RESULT-VAL      PIC I.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE 42 TO SHARED-VAL.
        SYNC WORKGROUP.
        MOVE SHARED-VAL TO RESULT-VAL.
        GOBACK.
