IDENTIFICATION DIVISION.
PROGRAM-ID. SHARED-INIT-ERR.
DATA DIVISION.
LOCAL-STORAGE SECTION.
01  BAD-VAL PIC I VALUE 10.
PROCEDURE DIVISION.
    MAIN-LOGIC.
    GOBACK.
