IDENTIFICATION DIVISION.
PROGRAM-ID. MATRIX-PALETTE-SKINNING.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. VULKAN-VERTEX-SHADER.
SPECIAL-NAMES.
    GPU-POSITION IS OUT-POS.

INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT PALETTE-BUFFER ASSIGN TO "GPU-BUFFER-0-0"
        ORGANIZATION IS ACCESS-UNIFORM.
    SELECT PUSH-CONSTANTS ASSIGN TO "GPU-PUSH-CONSTANT"
        ORGANIZATION IS ACCESS-PUSH.

DATA DIVISION.
FILE SECTION.
FD  PALETTE-BUFFER.
01  PALETTE-DATA.
    05  BONE-MAT PIC M(4,4) OCCURS 64 TIMES.

FD  PUSH-CONSTANTS.
01  PUSH-DATA.
    05  VIEW-PROJ PIC M(4,4).

INPUT SECTION.
01  IN-POS PIC V(4) LOCATION 0.
01  IN-WEIGHTS PIC V(4) LOCATION 1.
01  IN-INDICES PIC IV(4) LOCATION 2.

OUTPUT SECTION.
01  OUT-POS PIC V(4) IS BUILT-IN.
01  OUT-COLOR PIC V(4) LOCATION 0.

WORKING-STORAGE SECTION.
01  SKINNED-POS PIC V(4).
01  TEMP-POS PIC V(4).

PROCEDURE DIVISION.
    MAIN.
        COMPUTE SKINNED-POS = (BONE-MAT (X OF IN-INDICES) OF PALETTE-DATA * IN-POS) * X OF IN-WEIGHTS.
        
        COMPUTE TEMP-POS = (BONE-MAT (Y OF IN-INDICES) OF PALETTE-DATA * IN-POS) * Y OF IN-WEIGHTS.
        COMPUTE SKINNED-POS = SKINNED-POS + TEMP-POS.
        
        COMPUTE TEMP-POS = (BONE-MAT (Z OF IN-INDICES) OF PALETTE-DATA * IN-POS) * Z OF IN-WEIGHTS.
        COMPUTE SKINNED-POS = SKINNED-POS + TEMP-POS.
        
        COMPUTE TEMP-POS = (BONE-MAT (W OF IN-INDICES) OF PALETTE-DATA * IN-POS) * W OF IN-WEIGHTS.
        COMPUTE SKINNED-POS = SKINNED-POS + TEMP-POS.

        COMPUTE OUT-POS = VIEW-PROJ OF PUSH-DATA * SKINNED-POS.
        MOVE IN-WEIGHTS TO OUT-COLOR.
        GOBACK.
