IDENTIFICATION DIVISION.
PROGRAM-ID. STORAGE-2D-ARRAY-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (8, 8, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT TARGET-IMAGE ASSIGN TO "GPU-IMAGE-0-0"
        ORGANIZATION IS STORAGE-2D-ARRAY.
DATA DIVISION.
FILE SECTION.
FD  TARGET-IMAGE.
    FORMAT IS RGBA32F.
01  IMAGE-RECORD PIC V(4).
WORKING-STORAGE SECTION.
01  UV-COORDS           PIC V(3).
01  RAW-PIXEL           PIC V(4).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE (1.0, 1.0, 1.0, 1.0) TO RAW-PIXEL.
        MOVE (0.0, 0.0, 0.0) TO UV-COORDS.
        WRITE TARGET-IMAGE 
            FROM RAW-PIXEL 
            AT UV-COORDS.
        GOBACK.
