IDENTIFICATION DIVISION.
PROGRAM-ID. STORAGE-SCALAR-TEST.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT DATA-BUF ASSIGN TO "GPU-BUFFER-0-0"
        ORGANIZATION IS ACCESS-STORAGE.
DATA DIVISION.
FILE SECTION.
FD  DATA-BUF
    LAYOUT IS SCALAR.
01  STORAGE-DATA.
    05  VAL PIC FLOAT.
    05  POS PIC V(3).
WORKING-STORAGE SECTION.
01  TMP PIC FLOAT.
PROCEDURE DIVISION.
    MAIN.
        MOVE VAL OF STORAGE-DATA TO TMP.
        MOVE TMP TO X OF POS OF STORAGE-DATA.
        GOBACK.
