IDENTIFICATION DIVISION.
PROGRAM-ID. STORAGE-READ-NO-FORMAT-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (1, 1, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT SOURCE-IMAGE ASSIGN TO "GPU-IMAGE-0-0"
        ORGANIZATION IS STORAGE-2D.
DATA DIVISION.
FILE SECTION.
FD  SOURCE-IMAGE.
01  IMAGE-RECORD PIC V(4).
WORKING-STORAGE SECTION.
01  UV-COORDS           PIC IV(2).
01  RAW-PIXEL           PIC V(4).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE (0, 0) TO UV-COORDS.
        READ SOURCE-IMAGE 
            AT UV-COORDS 
            INTO RAW-PIXEL.
        GOBACK.
