IDENTIFICATION DIVISION.
PROGRAM-ID. STORAGE-ARRAY-WRITE-TEST.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT DATA-BUFFER ASSIGN TO "GPU-BUFFER-0-0"
        ORGANIZATION IS ACCESS-STORAGE.
DATA DIVISION.
FILE SECTION.
FD  DATA-BUFFER.
01  STORAGE-DATA.
    05  ARRAY-F PIC FLOAT OCCURS 4 TIMES.
WORKING-STORAGE SECTION.
01  INPUT-F PIC FLOAT VALUE 1.23.
PROCEDURE DIVISION.
    MAIN.
        MOVE INPUT-F TO ARRAY-F (3) OF STORAGE-DATA.
        GOBACK.
