IDENTIFICATION DIVISION.
PROGRAM-ID. SUBGROUP-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1)
    GPU-SUBGROUP-ID IS SG-ID
    GPU-SUBGROUP-SIZE IS SG-SIZE.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 SG-ID PIC U IS BUILT-IN.
    01 SG-SIZE PIC U IS BUILT-IN.
    01 MY-ID PIC U.
    01 MY-SIZE PIC U.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE SG-ID TO MY-ID.
        MOVE SG-SIZE TO MY-SIZE.
        GOBACK.
