IDENTIFICATION DIVISION.
PROGRAM-ID. SWIZZLE-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 MY-VEC PIC IV(4).
    01 OTHER PIC I.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE 1 TO X OF MY-VEC.
        MOVE 2 TO Y OF MY-VEC.
        MOVE 3 TO Z OF MY-VEC.
        MOVE 4 TO W OF MY-VEC.
        MOVE X OF MY-VEC TO OTHER.
        MOVE Z W OF MY-VEC TO X Y OF MY-VEC.
        GOBACK.
