IDENTIFICATION DIVISION.
PROGRAM-ID. TEXTURE-SIZE-TEST.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
    LOCAL-SIZE IS (64, 1, 1).
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT TEX ASSIGN TO "GPU-IMAGE-0-0" ORGANIZATION IS IMAGE-2D.
DATA DIVISION.
FILE SECTION.
FD  TEX.
01  TEX-REC PIC V(4).
WORKING-STORAGE SECTION.
01  DIMS PIC IV(2).
PROCEDURE DIVISION.
    MAIN-LOGIC.
        INQUIRE TEX FOR SIZE AT LOD 1 GIVING DIMS.
        GOBACK.
