IDENTIFICATION DIVISION.
PROGRAM-ID. UNDECLARED-QUALIFIED.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  MY-RECORD.
    05  VAL PIC I.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE 42 TO NON-EXISTENT OF MY-RECORD.
        GOBACK.
