IDENTIFICATION DIVISION.
PROGRAM-ID. UNIFORM-TEST.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT SETTINGS ASSIGN TO "GPU-BUFFER-0-0"
        ORGANIZATION IS ACCESS-UNIFORM.
DATA DIVISION.
FILE SECTION.
FD  SETTINGS.
01  UNIFORM-DATA.
    05  SCALAR-F PIC FLOAT.
    05  VEC3-F PIC V(3).
    05  SCALAR-I PIC I.
WORKING-STORAGE SECTION.
01  RESULT-F PIC FLOAT.
PROCEDURE DIVISION.
    MAIN.
        COMPUTE RESULT-F = SCALAR-F OF UNIFORM-DATA + X OF VEC3-F OF UNIFORM-DATA.
        GOBACK.
