IDENTIFICATION DIVISION.
PROGRAM-ID. UNIFORM-ARRAY-TEST.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT SETTINGS ASSIGN TO "GPU-BUFFER-0-0"
        ORGANIZATION IS ACCESS-UNIFORM.
DATA DIVISION.
FILE SECTION.
FD  SETTINGS.
01  UNIFORM-DATA.
    05  SCALAR-F PIC FLOAT.
    05  ARRAY-F PIC FLOAT OCCURS 4 TIMES.
    05  VEC4-F PIC V(4).
WORKING-STORAGE SECTION.
01  RESULT-F PIC FLOAT.
PROCEDURE DIVISION.
    MAIN.
        MOVE ARRAY-F (2) OF UNIFORM-DATA TO RESULT-F.
        GOBACK.
