IDENTIFICATION DIVISION.
PROGRAM-ID. VALUE-TEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 MY-INT PIC I VALUE 123.
    01 MY-FLOAT PIC FLOAT VALUE 3.14.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        GOBACK.
