IDENTIFICATION DIVISION.
PROGRAM-ID. VERTEX-BASIC.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. VULKAN-VERTEX-SHADER.
SPECIAL-NAMES.
    GPU-POSITION IS OUT-POS.
    GPU-VERTEX-INDEX IS VERT-ID.

DATA DIVISION.
INPUT SECTION.
01 IN-POS PIC V(3) LOCATION 0.
01 IN-COLOR PIC V(4) LOCATION 1.

OUTPUT SECTION.
01 OUT-COLOR PIC V(4) LOCATION 0.
01 OUT-POS PIC V(4) IS BUILT-IN.

WORKING-STORAGE SECTION.
01 VERT-ID PIC I IS BUILT-IN.

PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE (X Y Z OF IN-POS, 1.0) TO OUT-POS.
        MOVE IN-COLOR TO OUT-COLOR.
        GOBACK.
