IDENTIFICATION DIVISION.
PROGRAM-ID. CUBE-VS.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. VULKAN-VERTEX-SHADER.
SPECIAL-NAMES.
    GPU-POSITION IS OUT-POS.
    GPU-VERTEX-INDEX IS VERT-ID.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT CONSTANTS ASSIGN TO "GPU-PUSH-CONSTANT"
        ORGANIZATION IS ACCESS-PUSH.
DATA DIVISION.
FILE SECTION.
FD CONSTANTS.
01 PUSH-DATA.
    05 MVP PIC M(4,4).
INPUT SECTION.
01 IN-POS PIC V(3) LOCATION 0.
01 IN-COLOR PIC V(3) LOCATION 1.
OUTPUT SECTION.
01 OUT-COLOR PIC V(3) LOCATION 0.
01 OUT-POS PIC V(4) IS BUILT-IN.
WORKING-STORAGE SECTION.
01 VERT-ID PIC I IS BUILT-IN.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        COMPUTE OUT-POS = MVP OF PUSH-DATA * (X Y Z OF IN-POS, 1.0).
        MOVE IN-COLOR TO OUT-COLOR.
        GOBACK.
