IDENTIFICATION DIVISION.
PROGRAM-ID. CUBE-FS.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. VULKAN-FRAGMENT-SHADER.
DATA DIVISION.
INPUT SECTION.
01 IN-COLOR PIC V(3) LOCATION 0.
OUTPUT SECTION.
01 OUT-COLOR PIC V(4) LOCATION 0.
PROCEDURE DIVISION.
    MAIN-LOGIC.
        MOVE (X Y Z OF IN-COLOR, 1.0) TO OUT-COLOR.
        GOBACK.
